[
  [
    "button,닫기,class=btn-close-main-notice,type=buttonundefined",
    {
      "question": "\"닫기\" 버튼은 지금 보고 계신 화면에 있는 영화와 관련된 안내나 광고를 없애버리는 기능을 해요. 버튼을 누르면 지금 보이는 내용들이 사라지고, 다시 그 내용을 오늘은 볼 필요가 없게 되죠. 혹시 지금 화면에 있는 정보가 필요하지 않거나 다 읽으셨다면, \"닫기\" 버튼을 눌러서 창을 닫아보려고 하시겠어요?"
    }
  ],
  [
    "button,예매,class=button-bot,type=buttonundefined",
    {
      "question": "지금 보고 계신 화면은 영화를 보고 싶을 때 쉽게 티켓을 예매하실 수 있는 메가박스 영화관 웹사이트예요. 여기에 있는 '예매'라고 쓰여진 버튼을 누르시면, 원하시는 영화를 고르시고, 언제 보실지 시간도 선택할 수 있어요. 그렇게 해서 영화 표를 미리 사두실 수 있답니다. '예매' 버튼을 눌러서 영화 표 예매를 시작해 보고싶으신가요?"
    }
  ],
  [
    "a,class=h-ticket,href=javascript:AppDomain.Member.loginConfirm();undefined",
    {
      "question": "안녕하세요! 이 웹페이지에서는 영화를 보기 위해 표를 예매하실 수 있어요. 여기에는 'h-ticket'이란 버튼이 있답니다. 그 버튼을 누르면 MEGABOX라는 영화관 웹사이트로 넘어가서, 여러분의 계정이 로그인 되어 있는지를 확인해요. 만약 로그인이 되어 있지 않다면 로그인을 도와드릴게요. 로그인을 한 뒤에는 영화 표를 예매하거나 여러분이 원하는 서비스를 이용하실 수 있지요.\n\n그럼 지금 'h-ticket' 버튼을 클릭해서, 여러분의 로그인 상태를 확인해보고 영화 표를 예매해볼까요?"
    }
  ],
  [
    "a,어떤영화를보고 싶으세요?영화별 예매,href=javascript:fn_reserveChoice(moveType.movie, '')undefined",
    {
      "question": "그럼요, 이 밝은 부분을 보세요, '영화별 예매'라고 써있는 곳이잖아요? 여기를 누르면, 우리가 보고 싶은 영화를 바로 찾아서 표를 살 수 있는 페이지로 갈 거예요. 편리하죠? 그래서 관심 있는 영화를 골라서 앉고 싶은 자리까지 정해서 예매할 수 있답니다. 이 기능을 사용해볼까요, 어떤 영화를 보고 싶으신가요?"
    }
  ],
  [
    "a,전체,class=btn on,href=javascript:void(0)undefined",
    {
      "question": "먼저, '전체' 버튼은 마치 큰 쇼핑몰에서 모든 상품을 한번에 볼 수 있는 곳으로 가는 것과 같아요. 이 버튼을 누르시면, 아주 많은 종류의 영화들을 한꺼번에 보실 수 있답니다. 카테고리에 구애받지 않고요, 다양한 영화 중에서 마음에 드시는 것을 찾아보실 수 있어요.\n\n지금, '전체' 버튼을 눌러서 모든 영화들을 살펴보시고 싶으신가요?"
    }
  ],
  [
    "ul,12세이상관람가서울의 봄 15세이상관undefined",
    {
      "question": "아주 쉽게 이해하실 수 있도록 설명드릴게요.\n\n이 화면에서는 우리가 여러 영화들 중에서 관심 있는 영화를 찾아볼 수 있어요. 화면에 여러 개의 영화 포스터들이 나열되어 있고, 그 중에서 마음에 드는 영화를 볼 수 있답니다. 각 영화를 선택하면 그 영화에 대한 자세한 내용을 보실 수 있으며, 심지어 영화를 보기 위해 표를 예매하는 단계로도 넘어갈 수 있어요.\n\n지금 보이는 영화 목록에서 어떤 영화가 눈에 들어오시나요? 마음에 드는 영화를 하나 누르시면, 더 많은 정보를 얻을 수 있고, 필요하시다면 영화표를 예매하실 수도 있어요. 어떤 영화에 대해 더 알아보고 싶으신가요?"
    }
  ],
  [
    "ul,나의극장 0서울 19경기 30인천 5undefined",
    {
      "question": "\"안녕하세요! 지금 화면에서는 보고 싶은 영화를 어느 극장에서 볼지를 선택할 수 있어요. 컴퓨터 안에 들어있는 '목록'에서 여러분이 살고 계신 '동네' 혹은 가고 싶으신 '지역'을 고를 수 있답니다. 예를 들어서, '서울'이라고 되어 있는 글자를 손가락으로 누르시면 서울에 있는 여러 영화관들이 나타나게 되지요. 그중에서 가고 싶은 영화관을 최대 세 개까지 골라볼 수 있어요. 고르시고 나면 '확인' 버튼이라는 마지막 단계를 눌러주시면 돼요. 그럼 이제 어느 지역의 영화관을 먼저 볼까요? 서울, 부산, 대구 중에서 원하시는 곳을 말씀해주시면 됩니다!\""
    }
  ],
  [
    "a,큐레이션,class=btn,href=javascript:void(0)undefined",
    {
      "question": "아주 좋은 질문이네요! 이 화면에서 \"큐레이션\" 이라는 버튼을 사용하시면 마치 친구가 추천해주는 영화 목록을 볼 수 있는 것과 같아요. 큐레이터라는 영화 전문가가 골라낸 여러 영화 중에 재미있고 보기 좋은 영화들만을 모아서 보여드리는 기능이에요.\n\n그럼 이 기능을 이용해 추천 영화들을 보실래요?"
    }
  ],
  [
    "ul,지역별특별관undefined",
    {
      "question": "지금 보시는 화면에서는 영화를 보고 싶은 극장을 고르실 수 있답니다. 화면 위쪽에 '지역별'이라고 적힌 작은 칸(탭)이 보이시죠? 그 부분을 손가락으로 살짝 누르면, 우리나라 다양한 지역에 있는 영화관들이 목록으로 나오거든요. 이렇게 하면 여러분이 사시는 동네나 가까운 곳의 영화관을 더 쉽게 찾으실 수 있어요. 이 중에서 보고 싶은 영화관을 최대 세 군데까지 고르실 수 있어요. 어느 지역의 영화관을 찾아볼까요? 지역 이름을 말씀해주시면 그쪽 극장 목록으로 들어가 보겠습니다."
    }
  ],
  [
    "ul,나의극장 0서울 16경기 28인천 5undefined",
    {
      "question": "이 화면에는 여러분이 가고 싶은 영화관을 고를 수 있는 작은 버튼들이 있어요. 이 버튼들은 여러분이 살고 계시는 지역 이름이나 영화관 이름이 적혀 있는데요, 만약 서울에 있는 영화관을 찾고 싶으시면 '서울'이라 적힌 버튼을 누르시면 되어요. 그러면 서울 지역에 있는 영화관 목록이 화면에 나타날 거예요. 그 중에서 좋아하는 영화관을 골라서 최대 세 개까지 눌러서 선택할 수 있어요. 선택하신 영화관은 영화를 예매할 때 바로 이용할 수 있도록 도와드릴 거에요.\n\n그럼 지금 화면에서 어떤 동네 영화관을 보고 싶으신가요? 서울이나 부산 등 원하시는 곳을 말씀해주시면 거기에 속한 영화관을 보여드릴게요."
    }
  ],
  [
    "a,class=h-close,href=javascript:popupClose();undefined",
    {
      "question": "설명: 할머니, 할아버지, 여기 보이는 이 버튼은 '닫기' 버튼이에요. 우리가 영화관을 고르는 일을 다 끝냈으면 이 버튼을 눌러서 창을 닫을 수 있답니다. 그래야지만 우리가 한 일이 저장되고 다음 단계로 갈 수 있어요.\n\n질문: 선택하신 영화관이 마음에 드시면, 저희 이제 이 창을 닫아볼까요? '닫기' 버튼을 눌러서 창을 닫아주시면 됩니다."
    }
  ],
  [
    "input,id=searchText,type=textundefined",
    {
      "question": "당신이 찾고 싶은 영화가 있으신가요? 화면을 보시면 작은 상자가 보이실 거예요. 여기에는 ‘searchText’라고 쓰여 있어요. 이 상자는 우리가 영화 제목을 쓸 수 있는 곳이에요. 마치 주소록에 이름을 적어서 친구를 찾듯이, 여기에 영화 제목을 적어주시면, 그 영화를 화면에 보여주는 목록에서 빨리 찾을 수 있도록 도와줍니다.\n\n지금 보고 싶은 영화 제목이 머릿속에 있으시다면, 그 제목을 저한테 말씀해 주시겠어요? 제가 그걸 ‘searchText’라는 상자에 어떻게 적는지 보여드릴게요."
    }
  ],
  [
    "input,id=searchText,type=text서울의 봄",
    {
      "question": "먼저 \"서울의 봄\"이라는 영화를 찾고 싶으신가요? 화면에 보이는 'searchText'라는 작은 칸이 있는데요, 이곳에 이 영화 제목을 넣어주시면 컴퓨터가 우리를 도와서 \"서울의 봄\"이라는 영화만 딱 찾아내서 보여줄 거예요. 키보드로 하나씩 글자를 써 넣으시면 되는데, 어떠세요? 글자를 입력해보시겠어요?"
    }
  ],
  [
    "input,id=loginId,class=input-text enterTgt,type=textundefined",
    {
      "question": "물론이지요. 이 페이지에서는 'leesang627'이라는 이름으로 우리가 지울 수 있는 작은 박스에 써주셔야 해요. 그 박스는 당신이 계정에 들어갈 수 있게 도와주는 열쇠랍니다. 'leesang627'을 박스에 써주시고 나면 다음 단계로 갈 수 있어요. 지금 'leesang627'을 입력할 준비가 되셨나요?"
    }
  ],
  [
    "input,id=loginPwd,class=input-text enterTgt,type=passwordundefined",
    {
      "question": "이곳은 비밀번호를 입력하는 곳이에요. 비밀번호는 우리 집 열쇠처럼, 여러분만 아시는 비밀 번호랍니다. 이 번호를 넣으면, 컴퓨터나 휴대폰이 여러분이 맞는지 확인하고 안에 있는 정보들을 볼 수 있게 해주지요. 지금 보여드린 'EWenavd9pA8^' 이것이 바로 여러분의 비밀 번호입니다. 제가 이 번호를 대신 입력해드릴까요?"
    }
  ],
  [
    "button,로그인,id=loginBtn,class=button-bot purple,type=buttonundefined",
    {
      "question": "이 화면에 보이는 '로그인'이라는 큰 파란색 버튼을 보이시죠? 여기에 지금 아까 입력하신 아이디와 비밀번호를 확인한 뒤에, 우리가 이용하려는 웹사이트에서 여러분만의 공간으로 들어갈 수 있게 해주는 중요한 버튼입니다. 예를 들어, 예전에 열쇠로 집 문을 열듯이, 이 버튼을 누르면 여러분의 정보가 담긴 웹사이트 '집'으로 들어갈 수 있어요. 지금 준비가 다 되셨으면, 이 '로그인' 버튼을 눌러서 웹사이트에 들어가보실까요?"
    }
  ],
  [
    "ul,공주 논산 대전 대전신세계 아트앤사이,class=city-cont onundefined",
    {
      "question": "이 화면에서는 여러분이 가고 싶은 영화관을 고를 수 있어요. 여러분이 살고 계신 지역의 극장이나, 특별한 종류의 상영관 중에서 최대 세 군데까지 고를 수 있답니다. 예를 들어, 근처에 있는 '홍길동 영화관'이나 '가나다 특별관'처럼요.\n\n선택하신 극장이 화면에 표시된 목록에 있을 거예요. 그 리스트에서 가보고 싶은 극장 이름을 찾으시고, 그 극장 이름을 터치해 주시면 돼요. 터치하시면 컴퓨터가 여러분의 선택을 기억하고, 선택하신 영화관에 대한 정보로 화면을 바꿔드릴 거예요. 그런 다음에는 여러분이 선택하신 영화관에서 무슨 영화가 언제 시작하는지 확인하거나, 실제로 영화 표를 예약하는 단계로 넘어갈 수 있어요.\n\n지금 고르고 싶은 극장이 있으신가요? 이름을 말씀해 주시면 그 극장을 선택해 드릴게요."
    }
  ],
  [
    "button,선택 완료,id=theaterChoiceBtn,class=button-bot purple,type=buttonundefined",
    {
      "question": "이 페이지에서는 지도 위에 있는 여러 영화관 중 원하는 곳을 골라보실 수 있어요. 마음에 드는 영화관이 보이신다면, 그 영화관을 선택하시고, 화면에 보이는 '선택 완료'란 큼직한 버튼을 누르시면 돼요. 그러면 근처의 좋은 영화를 보러 갈 수 있는 영화관이 정해집니다. 지금 원하시는 영화관을 골라서 '선택 완료' 버튼을 누르실 준비가 되셨나요?"
    }
  ],
  [
    "div,202312월 04내일 05화 06수,class=swiper-wrapperundefined",
    {
      "question": "안녕하세요! 지금 보고 계신 이 웹페이지는 영화 예매를 위한 페이지로, 여기에서는 원하는 영화를 선택하고 어느 극장에서 볼 것인지, 어느 날짜에 볼 것인지를 정하실 수 있어요. 그리고 그 날짜에 맞는 상영 시간과 좌석을 확인하며, 바로 예매까지 하실 수 있답니다.\n\n보이는 링크를 누르시면, 여러분이 고르신 날짜에 맞춰 영화가 언제 시작하는지를 보여드리고, 그 시간에 맞춰 예약도 할 수 있게 화면을 바꿔드려요. 매우 편리하죠!\n\n이제, 여러분이 영화를 보고 싶으신 날짜를 알려주세요. 예를 들어, '다음 주 금요일'이나 '4월 10일'처럼 말씀해주시면 돼요. 어떤 날짜에 영화를 예매하고 싶으신가요?"
    }
  ]
]