[
  {
    "type": "screen",
    "id": "https://m.megabox.co.kr/",
    "screenDescription": "The screen provides a notice or announcement that can be closed and includes a link to an event, as well as an option to hide it for a day.",
    "actionDescription": "Click the \"닫기\" button to close the notice or announcement.",
    "screenChangeType": "URL_CHANGE"
  },
  {
    "type": "screen",
    "id": "https://m.megabox.co.kr/",
    "screenDescription": "The purpose of the screen is to display movie information, including titles, ratings, and booking options, as well as provide links to events and additional movie listings.",
    "actionDescription": "Click the '예매' button to proceed with booking the movie.",
    "screenChangeType": "CLOSE_LAYER"
  },
  {
    "type": "screen",
    "id": "https://m.megabox.co.kr/booking",
    "screenDescription": "The purpose of the screen is to provide information and options for booking movie tickets.",
    "actionDescription": "Select 서울의 봄 for select one movie from the list to choose which movie the user wants to book tickets for.",
    "screenChangeType": "URL_CHANGE"
  },
  {
    "type": "item",
    "id": "https://m.megabox.co.kr/booking",
    "screenDescription": "The purpose of the screen is to provide information and options for booking movie tickets.",
    "actionDescription": "Click on the element \"서울의 봄\" to move to the reservation page for booking movie tickets for the movie \"서울의 봄\".",
    "screenChangeType": "STATE_CHANGE"
  },
  {
    "type": "screen",
    "id": "https://m.megabox.co.kr/booking/movie",
    "screenDescription": "The purpose of the screen is to allow the user to select a theater, providing options based on location and special features.",
    "actionDescription": "Select 경기 30 for select one theater location from the list by clicking on the corresponding item, such as \"서울 19\", to choose a theater in seoul with 19 available options.",
    "screenChangeType": "URL_CHANGE"
  },
  {
    "type": "item",
    "id": "https://m.megabox.co.kr/booking/movie",
    "screenDescription": "The purpose of the screen is to allow the user to select a theater, providing options based on location and special features.",
    "actionDescription": "Click on the element with the purpose of selecting a theater in the 경기 area with the ID of 30.",
    "screenChangeType": "STATE_CHANGE"
  },
  {
    "type": "screen",
    "id": "https://m.megabox.co.kr/booking/movie",
    "screenDescription": "The purpose of the screen is to allow the user to select a theater, providing options based on location and special features.",
    "actionDescription": "Select 남양주현대아울렛 스페이스원 for select one theater from the list by clicking on the desired theater's name, which will likely redirect the user to a page with more information about that specific theater.",
    "screenChangeType": "STATE_CHANGE"
  },
  {
    "type": "item",
    "id": "https://m.megabox.co.kr/booking/movie",
    "screenDescription": "The purpose of the screen is to allow the user to select a theater, providing a list of options categorized by region and special theaters.",
    "actionDescription": "Click on the theater name \"남양주현대아울렛 스페이스원\" to select it as the preferred theater for the user.",
    "screenChangeType": "STATE_CHANGE"
  },
  {
    "type": "screen",
    "id": "https://m.megabox.co.kr/booking/movie",
    "screenDescription": "The purpose of the screen is to allow the user to select a theater location from a list of options categorized by region.",
    "actionDescription": "Click the '선택 완료' button to confirm the user's selection of a theater from the list.",
    "screenChangeType": "STATE_CHANGE"
  },
  {
    "type": "screen",
    "id": "https://m.megabox.co.kr/booking/movie",
    "screenDescription": "The purpose of the screen is to display movie showtimes and theater information for a specific movie in a specific location.",
    "actionDescription": "Select 2D1관 163석 11:00 ~13:31 143석 13:55 ~16:26 153석 16:50 ~19:21 158석 19:45 ~22:16 153석 for select one movie showtime from the list to choose the desired time slot for watching the movie at the specific theater location.",
    "screenChangeType": "OPEN_LAYER"
  },
  {
    "type": "item",
    "id": "https://m.megabox.co.kr/booking/movie",
    "screenDescription": "The purpose of the screen is to display the available movie showtimes and theaters for booking tickets.",
    "actionDescription": "Click on the element with the purpose of selecting the movie showtime from 11:00 to 13:31 for booking tickets.",
    "screenChangeType": "STATE_CHANGE"
  },
  {
    "type": "screen",
    "id": "https://m.megabox.co.kr/booking/movie",
    "screenDescription": "The purpose of the screen is to provide a login form for members and non-members to access the website or application.",
    "actionDescription": "Input leesang627 for input the user's login id into the text field with the purpose of providing the user's identification for the login process.",
    "screenChangeType": "OPEN_LAYER"
  }
]